sdaiTestAttrBN(Sdai_instS*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Determines if the value of attribute is unset.
\param instance [in] The instance of the entity whose attribute is being tested.
\param attributeName [in] The name of the attribute being tested.
\returns sdaiTRUE if the attribute has a value or sdaiFALSE if the attribute value is not set.